Repository: robs23/Texas
Catalog: Texas/Resources/Pages.Projects.Systo.*.resx
Languages: pl_pl

# CRM
source: Customer relationship management
pl_pl: Zarządzanie relacjami z klientami

# CRM-text
source: There's no business separated from other companies and to be competitive, one needs to learn how to manage its relationships professionally. CRM module of the application is great place to start. All users of the work space can keep track of the companies they work with, securely stroring their address,contact and financial data.
pl_pl: Nie ma biznesu oddzielonego od innych firm i aby być konkurencyjnym, trzeba nauczyć się profesjonalnie zarządzać swoimi relacjami. Moduł CRM aplikacji jest świetnym miejscem do rozpoczęcia. Wszyscy użytkownicy przestrzeni roboczej mogą prowadzić rejestr firm, z którymi pracują, bezpiecznie przechowując ich adres oraz ich dane kontaktowe i finansowe.

# HR
source: Employees' data under control
pl_pl: Dane pracowników pod kontrolą

# HR-text
source: User can create as many employees of his work space as he wants. He can fill in all employee-specific information like name, birthday, nationality, employment date, type of contract, tax number and employee's contact details. Thanks to that he'll have easy access to all the information when needed. The user can also create employee groups to bind employees e.g. of similar role within the company. All created employees are accessable everywhere within the application, so for example the user can later assign an employee as a driver to transport order.
pl_pl: Użytkownik może stworzyć nieograniczoną liczbę pracowników w swojej przestrzeni roboczej. Może on wypełnić wszystkie informacje dotyczące pracownika, takie jak imię i nazwisko, datę urodzenia, obywatelstwo, datę zatrudnienia, rodzaj umowy, numer podatkowy a także dane kontaktowe pracownika. Dzięki temu będzie miał łatwy dostęp do wszystkich informacji w razie potrzeby. Użytkownik może również tworzyć grupy pracowników do wiązania pracowników, np. pełniących podobne role w firmie. Wszyscy stworzeni pracownicy są dostępni wszędzie w obrębie aplikacji, więc na przykład użytkownik może później przypisać pracownika jako kierowcę do zlecenia transportowego.

# Logistics
source: Fleet management & transport orders
pl_pl: Zarządzanie flotą i zlecenia transportowe

# Logistics-text
source: The core functionality of the application in its current state is management of transport orders. The user can add transport order, both executed with company's own fleet or by subcontractor. Every order has to have start point and end point, but it's possible to create countless number of intermediate points. The user can choose a driver and a truck from company's own resources, or forwared in case of subcontracted orders.
pl_pl: Podstawową funkcjonalnością aplikacji w jej obecnym stanie jest zarządzanie zleceniami transportowymi. Użytkownik może dodać zlecenie transportowe, realizowane zarówno za pomocą własnej floty firmy, jak i podwykonawcy. Każde zamówienie musi mieć punkt początkowy i końcowy, ale możliwe jest również utworzenie niezliczonej liczby punktów pośrednich. Użytkownik może wybrać kierowcę i ciężarówkę z zasobów własnych firmy lub spedytora w przypadku zleceń podwykonawstwa.

# Modular
source: Modular construction
pl_pl: Modułowa budowa

# Modular-text
source: The application consists of modules corresponding to spheres of operation of typical company. Every module contains features typically associated to the sphere of operation it represents. For instance, <i>HR</i> module contains functions related to employee management and <i>Logistics</i> module concentrates mostly on transport matters.
pl_pl: Aplikacja składa się z modułów odpowiadających sferom działania typowej firmy. Każdy moduł zawiera funkcje zwykle związane ze sferą działania, którą reprezentuje. Na przykład moduł <i>HR</i> zawiera funkcje związane z zarządzaniem pracownikami, a moduł <i>Logistyka</i> koncentruje się głównie na kwestiach związanych z transportem.

# Multitenant
source: Multitenancy
pl_pl: Obsługa wielu użytkowników

# Multitenant-text
source: By registering directly in the application, the user A creates a unique work space for him and his work mates. In order to share data with his coleagues, the user invites them by their e-mail addresses. An e-mail is sent with personalized registration link, when the invited user B registers using it, he'll be autimatically assingned to user A's work space. The number of users within a single work space is limitless and all created data is accessable for all users of the work space. The number of work spaces is also limitless and no data is shared between two different work spaces.
pl_pl: Rejestrując się bezpośrednio w aplikacji, użytkownik A tworzy wyjątkową przestrzeń roboczą dla niego i jego współpracowników. Aby umożliwić dzielenie danych ze współpracownikami, użytkownik zaprasza ich za pomocą adresów e-mail. E-mail zostanie wysłany wraz ze spersonalizowanym odnośnikiem do rejestracji, gdy zaproszony użytkownik B zarejestruje się przy jego użyciu, zostanie automatycznie przypisany do przestrzeni roboczej użytkownika A. Liczba użytkowników w jednej przestrzeni roboczej jest nieograniczona, a wszystkie utworzone dane są dostępne dla wszystkich użytkowników tej przestrzeni. Liczba przestrzeni roboczych jest również nieograniczona i żadne dane nie są dzielone między dwoma różnymi przestrzeniami
